{"id":"insead_azure_sspr_cap_mfa","text":"Designing and Implementing AZURE cloud infrastructure with SSPR, CAP and MFA","tags":["azure","sspr","conditional access","mfa","cloud","security"],"seniority":"senior"}
{"id":"insead_ad_120k","text":"Orchestrated comprehensive oversight of 120K Active Directory user accounts for diverse profiles comprised of students and educators; optimized account settings to enhance security measures without impacting usability.","tags":["active directory","security","account management","operations"],"seniority":"senior"}
{"id":"insead_o365_120k","text":"Executed strategic oversight of O365 mailboxes, ensuring optimal performance and accessibility for over 120K active users; achieved seamless integration within existing systems by addressing common account-related issues directly impacting student engagement.","tags":["microsoft 365","o365","exchange","operations"],"seniority":"senior"}
{"id":"insead_l2_mentoring","text":"Guide Level 2 support team on BAU activities and provide leadership for mentoring.","tags":["leadership","mentoring","team management"],"seniority":"senior"}
{"id":"insead_automation_30","text":"Implementing automation for routine tasks via logic apps and PowerShell which cut down operational hours spent by 30%.","tags":["automation","logic apps","powershell","efficiency"],"seniority":"senior"}
{"id":"insead_email_auth","text":"Managing SPF, DMARC and DKIM authentication using Vali mail for external mail domains.","tags":["email security","spf","dmarc","dkim","valimail"],"seniority":"senior"}
{"id":"insead_cis_qualys","text":"Influence Cyber security posture of the company by incorporating CIS standards to reduce the vulnerability score in Qulays.","tags":["security","cis","qualys","vulnerability management"],"seniority":"senior"}
{"id":"insead_hyper_auto_coe","text":"Acting as an automation expert in the Hyper-Automation COE, aiding to centralize all automation efforts throughout the company.","tags":["automation","coe","center of excellence"],"seniority":"senior"}
{"id":"insead_ad_migration","text":"Spearheading the INSEAD AD Migration project to move 125K accounts, 20K security groups and 1000+ computer objects to a new domain with a scalable OU design.","tags":["active directory","migration","ou design","project leadership"],"seniority":"senior"}
{"id":"insead_sso_cert","text":"Renewed the INSEAD Wildcard certificate for SSO affecting 220 Application environments without any P1 incidents during a 1-hour window.","tags":["sso","certificates","change management","zero downtime"],"seniority":"senior"}
{"id":"insead_mfa_migration","text":"Migrated 120k user accounts from DUO MFA to Azure MFA including Windows and Linux MFA for servers.","tags":["mfa","azure","migration","security"],"seniority":"senior"}
{"id":"insead_ansible_conversion","text":"Transformed 50+ PowerShell scripts to Ansible templates, enhancing version control, security, and access control for the service desk.","tags":["ansible","powershell","automation","governance"],"seniority":"senior"}
{"id":"moqd_low_code_15h","text":"Spearheaded the transition towards low-code/no-code workflow solutions for cross-departmental teams, achieving time savings of approximately 15 hours per week for project completion through structured collaboration efforts.","tags":["low-code","no-code","workflow","power automate","efficiency"],"seniority":"mid-senior"}
{"id":"moqd_automation_40","text":"Orchestrated the design and execution of comprehensive automation solutions, including patching and intelligent document processing; directly resulting in a 40% decrease in manual task completion time across operations.","tags":["automation","patching","document processing","efficiency"],"seniority":"mid-senior"}
{"id":"moqd_bottlenecks","text":"Championed collaborative sessions with Technical Leads and Business Unit Heads to pinpoint specific process inefficiencies, delivering comprehensive findings that rectify three significant bottlenecks affecting overall productivity.","tags":["process improvement","collaboration","leadership"],"seniority":"mid-senior"}{"id":"moqd_automation_capabilities","text":"Advanced automation capabilities within MOQdigital.","tags":["automation","innovation"],"seniority":"mid-senior"}
{"id":"moqd_problem_solving","text":"Resolved intricate problems related to newly implemented automations as an integral part of the team's success; identified key areas needing improvement based on findings from direct interaction with end users daily.","tags":["problem solving","troubleshooting","user feedback"],"seniority":"mid-senior"}
{"id":"moqd_itil_30","text":"Executed robust ITIL frameworks encompassing Change and Incident Management processes; crafted a systematic approach leading to an impressive 30% boost in issue resolution speed across all teams within the automation division.","tags":["itil","change management","incident management","process"],"seniority":"mid-senior"}
{"id":"moqd_cross_bu_comm","text":"Established robust communication channels between Business Unit Heads when identifying areas ripe for process improvement initiatives; fostered teamwork efforts that resulted in developing five successful projects impacting revenue streams positively.","tags":["communication","collaboration","project management"],"seniority":"mid-senior"}
{"id":"moqd_team_creation","text":"Pioneered innovative strategies leading to effective resource allocation during the creation of an internal Automation team; established standardized workflows which resulted in saving 150+ hours monthly spent on manual tasks through automation technologies.","tags":["team building","automation","workflow standardization"],"seniority":"mid-senior"}
{"id":"moqd_azure_patch_60","text":"Implemented an Azure Patch Automation solution using Azure Update Management, PowerShell, and Power BI to streamline patching processes and reduce operational overhead by 60%.","tags":["azure","patching","powershell","power bi","automation"],"seniority":"mid-senior"}
{"id":"moqd_power_bi_75","text":"Transitioned from MS Excel to Power BI for data visualization, creating KPI and Automation Team Dashboards that simplified reporting processes, resulting in a 75% reduction in report generation time.","tags":["power bi","reporting","dashboards","visualization"],"seniority":"mid-senior"}
{"id":"pearson_800_hosts","text":"Sustained and supported over 800+ host VMware environments by offering guidance and supervision to engineers and other peers in the department.","tags":["vmware","leadership","operations","scale"],"seniority":"mid-senior"}
{"id":"pearson_bcs_tier3","text":"Coordinate with VMware BCS technical division to mitigate tier 3 Priority one incidents.","tags":["vmware","tier3","incident management","vendor coordination"],"seniority":"mid-senior"}
{"id":"pearson_vmware_admin","text":"Serving as a VMWare Administrator providing mid-senior level Tier 3 virtualization system administration support services.","tags":["vmware","administration","tier3","virtualization"],"seniority":"mid-senior"}
{"id":"pearson_uptime_30","text":"Administered comprehensive assessments on existing virtualization services leading to significant enhancements; findings directly enhanced reliability issues contributing to an overall boost in system uptime by more than 30%.","tags":["vmware","assessment","reliability","uptime"],"seniority":"mid-senior"}
{"id":"pearson_hardening","text":"Implemented targeted security hardening measures based on evaluations supervised in a controlled DT&E setup with over six configurations tested monthly ensuring resilience against emerging threats without sacrificing usability or performance levels.","tags":["security","hardening","testing","vmware"],"seniority":"mid-senior"}
{"id":"pearson_powercli_upgrades","text":"Deployed VMware vSphere tools for seamless installation processes while mastering PowerCLI commands; boosted upgrade turnaround times from weeks to a mere three days through efficient scripting techniques.","tags":["vmware","powercli","automation","upgrades"],"seniority":"mid-senior"}
{"id":"pearson_documentation","text":"Enhanced existing VMware documentation processes by systematically updating operation manuals to align with industry standards; reduced manual errors during audits by over 30%, improving overall system reliability.","tags":["documentation","governance","compliance","vmware"],"seniority":"mid-senior"}
{"id":"pearson_hostomator","text":"Perfected an automated VMware ESXi patching solution, \"Host' O Mator,\" using PowerCLI, reducing operational overhead by saving over 4,800 man-hours annually.","tags":["vmware","automation","powercli","patching","innovation"],"seniority":"mid-senior"}{"id":"pearson_hackathon","text":"3rd place in Hackathon conducted by Pearson Tech Summit.","tags":["award","innovation","hackathon"],"seniority":"mid-senior"}
{"id":"99x_vcenter_2000vms","text":"Managed and maintained VMware vCenter 5.x/6.x environments with over 2,000 VMs across 100+ blade servers in 20+ clusters.","tags":["vmware","vcenter","scale","operations"],"seniority":"mid"}
{"id":"99x_esxi_ha_drs","text":"Deployed and configured 50+ ESXi servers with high availability (HA) and distributed resource scheduling (DRS), optimizing vCenter setups on enterprise-grade hardware, enhancing system uptime by approximately 99.9%.","tags":["vmware","esxi","ha","drs","availability"],"seniority":"mid"}
{"id":"99x_powershell_compliance","text":"Transformed existing procedural inefficiencies into streamlined automation using advanced coding techniques within PowerShell environment; directly contributed to meeting rigorous compliance deadlines with zero audit findings over six consecutive months.","tags":["powershell","automation","compliance","governance"],"seniority":"mid"}
{"id":"99x_vm_operations","text":"Performed VM deployments, storage and host migrations, and network configurations for vMotion and VLANs.","tags":["vmware","vmotion","storage","networking","migrations"],"seniority":"mid"}
{"id":"99x_incident_resolution","text":"Resolved a range of critical incidents related to VMware infrastructure components including vCenter and VMs; findings identified root causes leading to major enhancements in overall system stability within six months.","tags":["incident management","vmware","troubleshooting","stability"],"seniority":"mid"}
{"id":"99x_monitoring","text":"Monitored systems using SCOM and Nagios while managing incidents, service requests, and changes.","tags":["monitoring","scom","nagios","incident management"],"seniority":"mid"}
{"id":"99x_rising_star","text":"Rising Star of the year 2016 at 99X Service's Annual Award Ceremony 2016.","tags":["award","recognition"],"seniority":"mid"}
{"id":"99x_employee_quarter","text":"Employee of the 4th Quarter at 99X Service's Annual Award Ceremony 2017.","tags":["award","recognition"],"seniority":"mid"}
{"id":"99x_patch_automation","text":"Pioneered the design and deployment of a Windows-based Patch Automation Solution using SCCM and MS Orchestrator, resulting in an impressive 75% reduction in manual patching efforts across all systems.","tags":["sccm","orchestrator","automation","patching","windows"],"seniority":"mid"}
{"id":"lanka_l1_l2_support","text":"Catering L1 and L2 support for customer network issues, ensuring timely resolution of faults and excellent customer service.","tags":["support","networking","customer service"],"seniority":"associate"}
{"id":"lanka_datacenter_ops","text":"Directed datacenter operations with a focus on rectifying routing issues, guiding new connections for clients, and conducting detailed fault analysis to enhance service reliability across 100+ customer accounts.","tags":["datacenter","operations","networking","routing"],"seniority":"associate"}
{"id":"lanka_network_config","text":"Configured and troubleshot internet, VPN, Linux-based 3G routers, and Wi-Fi networks for vendors such as Mikrotik, Ubiquiti, Unifi, and Cisco.","tags":["networking","vpn","mikrotik","ubiquiti","cisco","wifi"],"seniority":"associate"}
{"id":"lanka_customer_solutions","text":"Delivered customer first solutions by diagnosing and resolving technical issues with a focus on efficiency and reliability.","tags":["customer service","troubleshooting","problem solving"],"seniority":"associate"}
{"id":"lanka_observium_ospf","text":"Innovated a responsive web application showcasing live changes in the OSPF network topology using Observium; delivered immediate insights that improved troubleshooting times by 30% during peak operational hours.","tags":["observium","ospf","networking","web development","innovation"],"seniority":"associate"}
{"id":"eyepax_web_dev","text":"Designed and developed web applications, including content creation, client-side/server-side scripting, and e-commerce functionality.","tags":["web development","programming","e-commerce"],"seniority":"junior"}
{"id":"eyepax_system_analysis","text":"Conducted thorough analysis of existing systems and identified key areas for improvement; drafted comprehensive specifications leading to a 25% increase in operational efficiency within the first quarter post-implementation.","tags":["system analysis","process improvement","efficiency"],"seniority":"junior"}
{"id":"eyepax_testing_training","text":"Conducted product testing in controlled environments and prepared user training manuals for seamless deployment.","tags":["testing","documentation","training"],"seniority":"junior"}
{"id":"eyepax_api_integration","text":"Crafted an innovative app utilizing Gmail and JIRA APIs in PHP; enabled tracking of applicant progress while automating reporting functions, ultimately reducing manual entry time by 60 hours per month across the recruitment team.","tags":["php","api integration","gmail api","jira api","automation","recruitment"],"seniority":"junior"}
